{
  "id": "doc-005",
  "title": "Airworthiness Directive AD-2025-02: Mandatory Inspection and Replacement of Hydraulic Pump Pressure Compensator",
  "type": "directive",
  "version": "1.0",
  "last_updated": "2025-04-10",
  "content": "This Airworthiness Directive (AD) requires inspection and, if necessary, replacement of the pressure compensator assembly on Parker Hannifin PV3-300 hydraulic pumps installed on Boeing 737-800 aircraft. This AD was prompted by reports of hydraulic system pressure fluctuations and loss of pressure due to premature wear of the pressure compensator spool.",
  "sections": [
    {
      "id": "doc-005-section-1",
      "title": "Summary",
      "content": "This Airworthiness Directive (AD) requires inspection and, if necessary, replacement of the pressure compensator assembly on Parker Hannifin PV3-300 hydraulic pumps installed on Boeing 737-800 aircraft. This AD was prompted by reports of hydraulic system pressure fluctuations and, in some cases, complete loss of hydraulic system pressure due to premature wear of the pressure compensator spool. The FAA is issuing this AD to address the unsafe condition on these products.\n\nThis AD supersedes Service Bulletin SB-2025-01 (doc-004) by making the inspection and replacement mandatory and revising the compliance timeline."
    },
    {
      "id": "doc-005-section-2",
      "title": "Affected Products",
      "content": "This AD applies to all Boeing 737-800 aircraft with Parker Hannifin PV3-300 hydraulic pumps (P/N: HYD-PUMP-001) installed, with serial numbers in the range of SN10001 through SN12500.\n\nNOTE: Pumps with serial numbers SN12501 and higher incorporate the improved pressure compensator design and are not affected by this AD.\n\nAffected Component:\n- Part Number: HYD-PUMP-001\n- Serial Number Range: SN10001 through SN12500\n- Name: Hydraulic Pump, Engine-Driven\n- Manufacturer: Parker Hannifin Corporation\n\nCross-reference: For detailed component information, refer to the Hydraulic Pump Component Maintenance Manual (doc-002)."
    },
    {
      "id": "doc-005-section-3",
      "title": "Unsafe Condition",
      "content": "This AD was prompted by reports of hydraulic system pressure fluctuations and, in three documented cases, complete loss of hydraulic system pressure during flight due to premature wear of the pressure compensator spool in certain Parker Hannifin PV3-300 hydraulic pumps.\n\nThe pressure compensator spool in affected pumps has been found to experience accelerated wear due to insufficient surface hardening during manufacturing. As the wear progresses, the following conditions may occur:\n\n1. Initial stage: Erratic system pressure fluctuations and reduced pump efficiency\n2. Intermediate stage: Increased case drain flow and potential overheating of the hydraulic system\n3. Advanced stage: Inability to maintain required system pressure\n\nIn the most severe cases, complete failure of the pressure compensator can result in loss of hydraulic system pressure to flight-critical systems, including primary flight controls, leading edge slats, landing gear extension/retraction, and normal brakes.\n\nThe FAA has determined that this condition, if not addressed, could result in reduced controllability of the aircraft during critical phases of flight.\n\nWARNING: Three incidents have been reported where aircraft experienced partial loss of flight control functionality due to hydraulic system pressure loss attributed to failed pressure compensator spools in the affected hydraulic pumps."
    },
    {
      "id": "doc-005-section-4",
      "title": "Required Actions",
      "content": "To address the unsafe condition described in Section 3 of this AD, you must accomplish the following actions:\n\n4.1 INSPECTION\n\nPerform a functional check of the hydraulic pump pressure compensator as follows:\n\n1. Connect hydraulic test equipment to the aircraft hydraulic test ports\n2. Operate the hydraulic system at normal pressure (3,000 psi / 20,684 kPa)\n3. Monitor system pressure for 5 minutes\n4. Cycle hydraulic demand by operating flight controls through full range of motion\n5. Monitor case drain flow\n\nAcceptance Criteria:\n- System pressure must remain within 2,850-3,150 psi (19,650-21,718 kPa)\n- Pressure fluctuations must not exceed ±150 psi (±1,034 kPa)\n- Case drain flow must not exceed 1.5 gallons per minute (5.7 liters per minute)\n\n4.2 REPLACEMENT\n\nIf the pump fails the functional check, or if the pump is within the affected serial number range and has accumulated more than 1,500 flight hours since new or overhaul, replace the pressure compensator assembly as follows:\n\nWARNING: Ensure all hydraulic pressure is relieved before performing maintenance on the pump. Failure to do so may result in personal injury or equipment damage.\n\nTools Required:\n- Standard mechanic's tool set\n- Torque wrench (0-25 ft-lb / 0-34 Nm)\n- New pressure compensator assembly (P/N: HYD-COMP-002)\n- New O-rings and backup rings (P/N: HYD-SEAL-KIT-001)\n\nProcedure:\n1. Gain access to the hydraulic pump on the engine\n2. Depressurize the hydraulic system\n3. Clean the area around the pressure compensator\n4. Remove the four bolts securing the compensator to the pump housing\n5. Carefully remove the compensator assembly\n6. Inspect the compensator bore in the pump housing for damage\n7. Install new O-rings and backup rings on the new compensator assembly\n8. Install the new compensator assembly\n9. Torque the four mounting bolts to 18-20 ft-lb (24-27 Nm) in a diagonal pattern\n10. Perform the functional check described in Section 4.1\n\nRefer to the Hydraulic Pump Component Maintenance Manual (doc-002) for detailed disassembly and assembly procedures.\n\n4.3 ALTERNATIVE METHODS OF COMPLIANCE (AMOC)\n\nThe Manager, Seattle ACO Branch, FAA, has the authority to approve AMOCs for this AD, if requested using the procedures found in 14 CFR 39.19. In accordance with 14 CFR 39.19, send your request to your principal inspector or local Flight Standards District Office, as appropriate. If sending information directly to the manager of the certification office, send it to the attention of the person identified in paragraph 4.4 of this AD.\n\nBefore using any approved AMOC, notify your appropriate principal inspector, or lacking a principal inspector, the manager of the local flight standards district office/certificate holding district office.\n\n4.4 RELATED INFORMATION\n\nFor more information about this AD, contact John Smith, Aerospace Engineer, Systems and Equipment Section, FAA, Seattle ACO Branch, 2200 South 216th St., Des Moines, WA 98198; phone: 206-555-1234; email: john.smith@faa.gov."
    },
    {
      "id": "doc-005-section-5",
      "title": "Compliance Timeline",
      "content": "You must comply with this AD within the compliance times specified, unless already done.\n\n5.1 INSPECTION COMPLIANCE TIMES\n\nFor all affected aircraft with hydraulic pumps in the serial number range SN10001 through SN12500:\n\n- For pumps with more than 1,500 flight hours since new or overhaul: Perform the inspection required by paragraph 4.1 of this AD within 100 flight hours or 30 days after the effective date of this AD, whichever occurs first.\n\n- For pumps with 1,500 flight hours or less since new or overhaul: Perform the inspection required by paragraph 4.1 of this AD within 300 flight hours or 90 days after the effective date of this AD, whichever occurs first.\n\n5.2 REPLACEMENT COMPLIANCE TIMES\n\nIf the inspection required by paragraph 4.1 of this AD indicates that the pump fails any of the acceptance criteria:\n\n- Replace the pressure compensator assembly as required by paragraph 4.2 of this AD before further flight.\n\nIf the pump passes the inspection but has accumulated more than 1,500 flight hours since new or overhaul:\n\n- Replace the pressure compensator assembly as required by paragraph 4.2 of this AD within 200 flight hours or 60 days after the effective date of this AD, whichever occurs first.\n\n5.3 REPETITIVE INSPECTIONS\n\nFor all affected aircraft with hydraulic pumps in the serial number range SN10001 through SN12500 that have not had the pressure compensator assembly replaced as required by paragraph 4.2 of this AD:\n\n- Repeat the inspection required by paragraph 4.1 of this AD at intervals not to exceed 300 flight hours or 90 days, whichever occurs first.\n\n5.4 TERMINATING ACTION\n\nReplacement of the pressure compensator assembly as required by paragraph 4.2 of this AD constitutes terminating action for the repetitive inspections required by paragraph 5.3 of this AD for that pump.\n\n5.5 PARTS INSTALLATION PROHIBITION\n\nAs of the effective date of this AD, no person may install a Parker Hannifin PV3-300 hydraulic pump with a serial number in the range SN10001 through SN12500 on any aircraft, unless the pressure compensator assembly has been replaced as required by paragraph 4.2 of this AD.\n\n5.6 EFFECTIVE DATE\n\nThis AD becomes effective on May 15, 2025."
    },
    {
      "id": "doc-005-section-6",
      "title": "Regulatory Information",
      "content": "6.1 REGULATORY ANALYSIS\n\nThe FAA has determined that this AD is an emergency regulation that must be issued immediately to correct an unsafe condition on these aircraft. It has been determined that this regulation is necessary to ensure the safety of the flying public. The FAA has found that the risk to the flying public justifies waiving notice and comment prior to adoption of this rule because premature wear of the pressure compensator spool could result in loss of hydraulic system pressure, affecting flight control systems and potentially leading to reduced controllability of the aircraft during critical phases of flight.\n\n6.2 AUTHORITY FOR THIS RULEMAKING\n\nTitle 49 of the United States Code specifies the FAA's authority to issue rules on aviation safety. Subtitle I, Section 106, describes the authority of the FAA Administrator. Subtitle VII, Aviation Programs, describes in more detail the scope of the Agency's authority.\n\nThe FAA is issuing this rulemaking under the authority described in Subtitle VII, Part A, Subpart III, Section 44701, \"General requirements.\" Under that section, Congress charges the FAA with promoting safe flight of civil aircraft in air commerce by prescribing regulations for practices, methods, and procedures the Administrator finds necessary for safety in air commerce. This regulation is within the scope of that authority because it addresses an unsafe condition that is likely to exist or develop on products identified in this rulemaking action.\n\n6.3 REGULATORY FINDINGS\n\nThe FAA has determined that this AD will not have federalism implications under Executive Order 13132. This AD will not have a substantial direct effect on the States, on the relationship between the national government and the States, or on the distribution of power and responsibilities among the various levels of government.\n\nFor the reasons discussed above, I certify that this AD:\n(1) Is not a \"significant regulatory action\" under Executive Order 12866, and\n(2) Will not affect intrastate aviation in Alaska."
    },
    {
      "id": "doc-005-section-7",
      "title": "Material Incorporated by Reference",
      "content": "None.\n\nHowever, the following documents contain information related to this AD:\n\n1. Boeing 737-800 Aircraft Maintenance Manual (doc-001), Chapter 29 - Hydraulic System\n2. Hydraulic Pump Component Maintenance Manual (doc-002)\n3. Illustrated Parts Catalog (doc-003), Chapter 29 - Hydraulic System\n4. Service Bulletin SB-2025-01 (doc-004)\n5. Parker Hannifin Service Letter SL-2025-03, dated 2025-03-15\n\nThese documents are not incorporated by reference in this AD. For information on obtaining these documents, contact:\n\nParker Hannifin Technical Support\nPhone: +1-800-555-0101\nEmail: techsupport@parker.com\nWebsite: www.parker.com/aerospace\n\nYou may view these documents at the FAA, Transport Standards Branch, 2200 South 216th St., Des Moines, WA. For information on the availability of this material at the FAA, call 206-555-1234."
    }
  ]
}