{
  "id": "doc-008",
  "title": "Airworthiness Directive AD-2025-05: Mandatory Inspection and Replacement of Main Battery Contactors",
  "type": "directive",
  "version": "1.0",
  "last_updated": "2025-04-20",
  "content": "This Airworthiness Directive (AD) requires inspection and, if necessary, replacement of the main battery contactors on Airbus A320 aircraft. This AD was prompted by reports of contactor contact welding that could prevent battery disconnection during electrical emergencies.",
  "sections": [
    {
      "id": "doc-008-section-1",
      "title": "Summary",
      "content": "This Airworthiness Directive (AD) requires inspection and, if necessary, replacement of the main battery contactors (P/N: BAT-CONT-001) installed on Airbus A320 aircraft. This AD was prompted by reports of contactor contact welding that could prevent battery disconnection during electrical emergencies. The FAA is issuing this AD to address the unsafe condition on these products.\n\nThis AD supersedes Service Bulletin SB-A320-24-001 (doc-007) by making the inspection and replacement mandatory and revising the compliance timeline."
    },
    {
      "id": "doc-008-section-2",
      "title": "Affected Products",
      "content": "This AD applies to all Airbus A320 aircraft with main battery contactors (P/N: BAT-CONT-001) manufactured by ElectroSwitch Inc. with date codes between 2024-01 and 2024-06.\n\nNOTE: Contactors with date codes 2024-07 and later incorporate the improved contact material and are not affected by this AD.\n\nAffected Component:\n- Part Number: BAT-CONT-001\n- Date Code Range: 2024-01 through 2024-06\n- Name: Contactor, Battery, Main\n- Manufacturer: ElectroSwitch Inc.\n\nCross-reference: For detailed component information, refer to the Airbus A320 Aircraft Maintenance Manual (doc-006)."
    },
    {
      "id": "doc-008-section-3",
      "title": "Unsafe Condition",
      "content": "This AD was prompted by reports of battery contactor contact welding and, in two documented cases, inability to disconnect the main battery during electrical emergency procedures due to welded contactor contacts in certain ElectroSwitch BAT-CONT-001 battery contactors.\n\nThe contactor contacts in affected units have been found to experience premature welding due to insufficient silver content in the contact material. As the condition progresses, the following situations may occur:\n\n1. Initial stage: Intermittent difficulty in disconnecting the battery\n2. Intermediate stage: Visible arcing when attempting to disconnect the battery\n3. Advanced stage: Complete inability to disconnect the battery from the aircraft electrical system\n\nIn the most severe cases, inability to disconnect the battery during an electrical emergency could prevent isolation of the battery from a short circuit, potentially resulting in battery overheating, thermal runaway, and electrical fire.\n\nThe FAA has determined that this condition, if not addressed, could result in inability to disconnect the battery during an electrical emergency, potentially leading to thermal runaway of the battery and electrical fire.\n\nWARNING: Two incidents have been reported where aircraft experienced inability to disconnect the main battery during electrical emergency procedures due to welded contactor contacts in the affected battery contactors."
    },
    {
      "id": "doc-008-section-4",
      "title": "Required Actions",
      "content": "To address the unsafe condition described in Section 3 of this AD, you must accomplish the following actions:\n\n4.1 INSPECTION\n\nPerform a functional check of the battery contactor as follows:\n\n1. Access the battery compartment in the avionics bay\n2. Connect a digital multimeter set to the resistance (ohms) function across the main terminals of the battery contactor\n3. With the Battery Master Switch in the ON position, verify continuity across the contactor (resistance less than 0.01 ohms)\n4. Turn the Battery Master Switch to the OFF position\n5. Verify that the contactor opens (resistance greater than 1 megohm)\n6. Repeat steps 3-5 three times\n\nIn addition, inspect the contactor for the following:\n1. Check the date code on the contactor label\n2. Inspect the contactor housing for discoloration or heat damage\n3. Check for any signs of electrical arcing or burning\n\n4.2 REPLACEMENT\n\nIf the contactor fails the functional check, or if the contactor has a date code between 2024-01 and 2024-06, replace the contactor as follows:\n\nWARNING: Ensure all aircraft electrical power is OFF and the battery is disconnected before replacing the contactor. Failure to do so may result in personal injury or equipment damage.\n\nTools Required:\n- Standard mechanic's tool set\n- Torque wrench (0-20 Nm)\n- New battery contactor (P/N: BAT-CONT-002)\n- Heat shrink tubing assortment\n- Crimping tool for electrical terminals\n\nProcedure:\n1. Disconnect and remove the aircraft battery\n2. Tag and disconnect all wires from the contactor, noting their positions\n3. Remove the mounting bolts securing the contactor to the battery compartment\n4. Remove the contactor from the aircraft\n5. Install the new contactor (P/N: BAT-CONT-002) in the same position\n6. Secure the contactor with the mounting bolts and torque to 8-10 Nm\n7. Reconnect all wires to their original positions on the contactor\n8. Reinstall the aircraft battery\n9. Perform the functional check described in Section 4.1\n\nRefer to the Airbus A320 Aircraft Maintenance Manual (doc-006) for detailed battery removal and installation procedures.\n\n4.3 ALTERNATIVE METHODS OF COMPLIANCE (AMOC)\n\nThe Manager, International Validation Branch, FAA, has the authority to approve AMOCs for this AD, if requested using the procedures found in 14 CFR 39.19. In accordance with 14 CFR 39.19, send your request to your principal inspector or local Flight Standards District Office, as appropriate. If sending information directly to the manager of the certification office, send it to the attention of the person identified in paragraph 4.4 of this AD.\n\nBefore using any approved AMOC, notify your appropriate principal inspector, or lacking a principal inspector, the manager of the local flight standards district office/certificate holding district office.\n\n4.4 RELATED INFORMATION\n\nFor more information about this AD, contact Jane Smith, Aerospace Engineer, Electrical Systems Section, FAA, International Validation Branch, 1200 Aviation Boulevard, Washington, DC 20591; phone: 202-555-1234; email: jane.smith@faa.gov."
    },
    {
      "id": "doc-008-section-5",
      "title": "Compliance Timeline",
      "content": "You must comply with this AD within the compliance times specified, unless already done.\n\n5.1 INSPECTION COMPLIANCE TIMES\n\nFor all affected aircraft with battery contactors in the date code range 2024-01 through 2024-06:\n\n- For aircraft with more than 500 flight hours since contactor installation: Perform the inspection required by paragraph 4.1 of this AD within 50 flight hours or 10 days after the effective date of this AD, whichever occurs first.\n\n- For aircraft with 500 flight hours or less since contactor installation: Perform the inspection required by paragraph 4.1 of this AD within 100 flight hours or 30 days after the effective date of this AD, whichever occurs first.\n\n5.2 REPLACEMENT COMPLIANCE TIMES\n\nIf the inspection required by paragraph 4.1 of this AD indicates that the contactor fails any of the acceptance criteria:\n\n- Replace the contactor as required by paragraph 4.2 of this AD before further flight.\n\nIf the contactor passes the inspection but has a date code between 2024-01 and 2024-06:\n\n- Replace the contactor as required by paragraph 4.2 of this AD within 300 flight hours or 90 days after the effective date of this AD, whichever occurs first.\n\n5.3 PARTS INSTALLATION PROHIBITION\n\nAs of the effective date of this AD, no person may install a battery contactor with P/N BAT-CONT-001 and a date code between 2024-01 and 2024-06 on any aircraft.\n\n5.4 EFFECTIVE DATE\n\nThis AD becomes effective on May 25, 2025."
    },
    {
      "id": "doc-008-section-6",
      "title": "Regulatory Information",
      "content": "6.1 REGULATORY ANALYSIS\n\nThe FAA has determined that this AD is an emergency regulation that must be issued immediately to correct an unsafe condition on these aircraft. It has been determined that this regulation is necessary to ensure the safety of the flying public. The FAA has found that the risk to the flying public justifies waiving notice and comment prior to adoption of this rule because contactor contact welding could prevent battery disconnection during electrical emergencies, potentially leading to thermal runaway of the battery and electrical fire.\n\n6.2 AUTHORITY FOR THIS RULEMAKING\n\nTitle 49 of the United States Code specifies the FAA's authority to issue rules on aviation safety. Subtitle I, Section 106, describes the authority of the FAA Administrator. Subtitle VII, Aviation Programs, describes in more detail the scope of the Agency's authority.\n\nThe FAA is issuing this rulemaking under the authority described in Subtitle VII, Part A, Subpart III, Section 44701, \"General requirements.\" Under that section, Congress charges the FAA with promoting safe flight of civil aircraft in air commerce by prescribing regulations for practices, methods, and procedures the Administrator finds necessary for safety in air commerce. This regulation is within the scope of that authority because it addresses an unsafe condition that is likely to exist or develop on products identified in this rulemaking action.\n\n6.3 REGULATORY FINDINGS\n\nThe FAA has determined that this AD will not have federalism implications under Executive Order 13132. This AD will not have a substantial direct effect on the States, on the relationship between the national government and the States, or on the distribution of power and responsibilities among the various levels of government.\n\nFor the reasons discussed above, I certify that this AD:\n(1) Is not a \"significant regulatory action\" under Executive Order 12866, and\n(2) Will not affect intrastate aviation in Alaska."
    },
    {
      "id": "doc-008-section-7",
      "title": "Material Incorporated by Reference",
      "content": "None.\n\nHowever, the following documents contain information related to this AD:\n\n1. Airbus A320 Aircraft Maintenance Manual (doc-006), Chapter 24 - Electrical Power\n2. Service Bulletin SB-A320-24-001 (doc-007)\n3. ElectroSwitch Component Maintenance Manual for Battery Contactor (P/N: BAT-CONT-001/002)\n4. ElectroSwitch Service Letter SL-2024-05, dated 2024-06-15\n5. EASA Safety Information Bulletin SIB-2024-10\n\nThese documents are not incorporated by reference in this AD. For information on obtaining these documents, contact:\n\nElectroSwitch Technical Support\nPhone: +1-800-555-7001\nEmail: techsupport@electroswitch.com\nWebsite: www.electroswitch.com/aerospace\n\nYou may view these documents at the FAA, Transport Standards Branch, 1200 Aviation Boulevard, Washington, DC 20591. For information on the availability of this material at the FAA, call 202-555-1234."
    }
  ]
}
